AcmeCode/micropython/ports/acmecode/boards/GENERIC/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "AcmeCode IoT"
#define MICROPY_HW_MCU_NAME "ESP32"
